Repository: kriptolix/Poliedros
Catalog: po/*.po
Languages: de, pt_br

source: GTK;Die;Dice;Roll;Random;Number;
de: GTK;Die;Dice;Roll;Random;Number;Würfel;würfeln;Wurf;Zufall;zufällig;Zahl;
pt_br: GTK;Dado;Dados;Rolagem;Aleatório;Numero;

source: Roll multi-type dice.
de: Würfeln Sie verschiedene Würfel.
pt_br: Poliedros é um rolador de múltiplos tipos de dados.

source: Poliedros is a multi-type dice roller. Basic mode allows you to make quick rolls using just the mouse, while Command mode allows for more complex rolls and combinations.
de: Poliedros simuliert das Würfeln verschiedener Würfel. Der einfache Modus ermöglicht es, schnelle Würfe mit der Maus durchzuführen - der Befehlsmodus hingegen ist gut geeignet für kompliziertere Würfe und Kombinationen.
pt_br: Poliedros é um rolador de múltiplos tipos de dados. O modo Básico permite realizar rolagens rápidas utilizando apenas o mouse, enquanto o modo Comando permite rolagens e combinações mais complexas.

source: Basic Mode.
de: Einfacher Modus.
pt_br: Modo Básico.

source: No sidebar.
de: Keine Seitenleiste.
pt_br: Sem a barra lateral.

source: Collapsed sidebar.
de: Eingeklappte Seitenleiste.
pt_br: Barra leteral colapsada.

source: Command Mode.
de: Befehlsmodus.
pt_br: Modo Comando.

source: translator_credits
de: Philipp Kiemle <l10n.daphipz@fastmail.de>
pt_br: Diego C. Sampaio

source: Plus Number
de: Plus Zahl
pt_br: Adicionar Numero

source: Minus Number
de: Minus Zahl
pt_br: Subtrair Numero

source: Nothing Here Yet
de: Hier ist noch nichts
pt_br: Nada Aqui Ainda

source: Roll some dice to begin
de: Würfeln Sie einige Würfel, um zu beginnen
pt_br: Role alguns dados para começar

source: Command Mode
de: Befehlsmodus
pt_br: Modo Comando

source: Command mode usage instructions
de: Verwendung des Befehlsmodus
pt_br: Instruções de uso do modo comando

source: Redo this roll
de: Diesen Wurf wiederholen
pt_br: Refazer essa rolagem

source: Go Back
de: Zurückgehen
pt_br: Voltar

source: Toggle History
de: Chronik umschalten
pt_br: Exibir/Ocultar Histórico

source: Keyboard Shortcuts
de: Tastenkürzel
pt_br: Atalhos de teclado

source: About Poliedros
de: Info zu Poliedros
pt_br: Sobre o Poliedros

source: Switch Mode
de: Modus wechseln
pt_br: Alternar Modo

source: Roll
de: Würfeln
pt_br: Rolar

source: Clear Command
de: Befehl leeren
pt_br: Limpar Comando

source: Clear results
de: Ergebnisse leeren
pt_br: Limpar Resultados

source: General
de: Allgemein
pt_br: Geral

source: Quit
de: Beenden
pt_br: Fechar

source: Clear the dice display
de: Die Würfelanzeige leeren
pt_br: Limpar Comando

source: Clear the roll logs
de: Den Wurfverlauf leeren
pt_br: Limpar Resultados

source: Toggle panel visibility
de: Sichtbarkeit der Seitenleiste umschalten
pt_br: Ativar/Desativar visibilidade do painel

source: Toggle command mode
de: Befehlsmodus umschalten
pt_br: Ativar/Desativar Modo Comando

source: Perform dice roll
de: Würfel werfen
pt_br: Executar uma rolagem

source: Additions and subtractions
de: Additionen und Subtraktionen
pt_br: Adições e subtrações

source: Add increment (+1)
de: Inkrement hinzufügen (+1)
pt_br: Adicionar incremento (+1)

source: Add decrement (-1)
de: Dekrement hinzufügen (-1)
pt_br: Adicionar decremento (-1)

source: Dice
de: Würfel
pt_br: Dados

source: Add a Fudge Die
de: Einen Fudge-Würfel hinzufügen
pt_br: Adicionar um dado Fudge

source: Add a d4
de: Einen d4 hinzufügen
pt_br: Adicionar um d4

source: Add a d6
de: Einen d6 hinzufügen
pt_br: Adicionar um d6

source: Add a d8
de: Einen d8 hinzufügen
pt_br: Adicionar um d8

source: Add a d10
de: Einen d10 hinzufügen
pt_br: Adicionar um d10

source: Add a d12
de: Einen d12 hinzufügen
pt_br: Adicionar um d12

source: Add a d20
de: Einen d20 hinzufügen
pt_br: Adicionar um d20

source: Add a d100
de: Einen d100 hinzufügen
pt_br: Adicionar um d100

source: Command usage instructions
de: Verwendung des Befehlsmodus
pt_br: Instruções de uso do comando

source: <b>Rolling dice:</b> operator "d". <b>Ex.:</b> 3d6, roll 3 6-sided dice. <b>Ex.:</b> 2df, roll 2 fudge dice (-1, 0 and 1 possible results). <b>Ex.:</b> It is possible to roll arbitrary dice like 1d7 or, 3d19.
de: <b>Würfel würfeln:</b> Befehl »d«. <b>Beispiel:</b> 3d6, würfelt 3 6-seitige Würfel. <b>Beispiel:</b> 2df, würfelt 2 Fudge-Würfel (-1, 0 und +1 sind mögliche Ergebnisse). <b>Beispiel:</b> Es ist möglich, unkonventionelle Würfel zu würfeln, z. B. 1d7 oder 3d19.
pt_br: <b>Rolando dados:</b> operador "d". <b>Ex.:</b> 3d6, rola 3 dados de 6 lados. <b>Ex.:</b> 2df, rola 2 dados fudge (-1, 0 e 1 como possíveis resultados). <b>Ex.:</b> É possível rolar dados arbitrários como 1d7 ou, 3d19.

source: <b>Additions/Subtractions:</b> "+" and "-" operators. <b>Ex.:</b> 1d6 + 3, roll 1 6-sided die and add the number 3. <b>Ex.:</b> 2d8 - 1d4, roll 2 8-sided dice and subtract the result of rolling 1 4-sided die.
de: <b>Addition/Subtraktion:</b> Befehle »+« und »-«. <b>Befehle:</b> 1d6 + 3, würfelt 1 6-seitigen Würfel und addiert die Zahl 3. <b>Befehle:</b> 2d8 - 1d4, würfelt 2 8-seitige Würfel und subtrahiert das Ergebnis des Wurfs von 1 4-seitigem Würfel.
pt_br: <b>Adições/Subtrações :</b> operadores "+" e "-". <b>Ex.:</b> 1d6 + 3, rola 1 dado de 6 faces e adiciona 3. <b>Ex.:</b> 2d8 - 1d4, rola 2 dados de 8 faces e subtrai o resultado da rolagem de 1 dado de 4 faces.

source: <b>Keeping higher:</b> operator "|kh:number". <b>Ex.:</b> 3d6|kh:2, roll 3 6-sided dice and keep the 2 highest. <b>Ex.:</b> 2d20|kh:1, roll 2 20-sided dice and keep the highest.
de: <b>Höhere behalten:</b> Befehl »|kh:zahl«. <b>Beispiel:</b> 3d6|kh:2, würfelt 3 6-seitige Würfel und behält die 2 höchsten Ergebnisse. <b>Beispiel:</b> 2d20|kh:1, würfelt 2 20-seitige Würfel und behält das höchste Ergebnis.
pt_br: <b>Mantendo os maiores:</b> operador "|kh:number". <b>Ex.:</b> 3d6|kh:2, rola 3 dados de 6 faces e mantêm os 2 maiores. <b>Ex.:</b> 2d20|kh:1, rola 2 dados de 20 faces mantêm o maior.

source: <b>Keeping lower:</b> operator "|kl:number". <b>Ex.:</b> 4d10|kl:2, roll 4 10-sided dice and keep the 2 lowest. <b>Ex.:</b> 3d6|kl:1, roll 3 6-sided dice and keep the lowest.
de: <b>Niedrigere behalten:</b> Befehl »|kl:zahl«. <b>Beispiel:</b> 4d10|kl:2, würfelt 4 10-seitige Würfel und behält die 2 niedrigsten Ergebnisse. <b>Beispiel:</b> 3d6|kl:1, würfelt 3 6-seitige Würfel und behält das niedrigste Ergebnis.
pt_br: <b>Mantendo os menores:</b> operador "|kl:number". <b>Ex.:</b> 4d10|kl:2, rola 4 dados de 10 faces e mantêm os 2 menores. <b>Ex.:</b> 3d6|kl:1, rola 3 dados de 6 faces e mantêm o menor.

source: <b>Functions parameters:</b> <b>Ex.:</b> >15: greater than number(inclusive). <b>Ex.:</b> 6,8,10: relation of arbitrary numbers. <b>Ex.:</b> 4: a single number. <b>Ex.:</b> &lt;10: lower than number (inclusive). <b>Ex.:</b> 80..90: interval between numbers (inclusive).
de: <b>Funktionsparameter:</b> <b>Beispiel:</b> >15: Größer als Zahl (inklusiv). <b>Beispiel:</b> 6,8,10: Eine Reihe an Zahlen. <b>Beispiel:</b> 4: Eine einfache Zahl. <b>Beispiel:</b> &lt;10: Niedriger als Zahl (inklusiv). <b>Beispiel:</b> 80..90: Zahlenintervall (inklusiv).
pt_br: <b>Parâmetros de função:</b>. <b>Ex.:</b> >15: maior que um numero (inclusivo). <b>Ex.:</b> 6,8,10: relação arbitraria de números. <b>Ex.:</b> 4: um numero único. <b>Ex.:</b> &lt;10: menor que um numero (inclusivo). <b>Ex.:</b> 80..90: intervalo entre números (inclusive).

source: <b>Count in:</b> operator "|cn:parameters". <b>Ex.:</b> 6d10|cn:6,8,10; roll 4 10-sided dice and count how many 6s,8s and 10s occur. <b>Ex.:</b> 4d4|cn:4; roll 4 4-sided dice and count how many 4s occur. <b>Ex.:</b> 6d20|cn:>15; roll 6 20-sided dice and count how many results greater than 15 occur. <b>Ex.:</b> 3d100|cn:80..90; roll 3 100-sided dice and count how many results between 80 and 90 occur occur.
de: <b>Würfel zählen:</b> Befehl »|cn:parameter«. <b>Beispiel:</b> 6d10|cn:6,8,10, würfelt 4 10-seitige Würfel und zählt alle 6er, 8er und 10er vorkommen. <b>Beispiel:</b> 4d4|cn:4, würfelt 4 4-seitige Würfel und zählt alle 4er. <b>Beispiel:</b> 6d20|cn:>15, würfelt 6 20-seitige Würfel und zählt alle Würfel über 15. <b>Beispiel:</b> 3d100|cn:80..90, würfelt 3 100-seitige Würfel und zählt alle Ergebnisse zwischen 80 und 90.
pt_br: <b>Contar:</b> operador "|cn:parâmetros". <b>Ex.:</b> 6d10|cn:6,8,10; rola 4 dados de 10 lados e conte quantos 6,8 e 10 saem. <b>Ex.:</b> 4d4|cn:4; rola 4 dados de 4 faces e conte quantos 4 saem. <b>Ex.:</b> 6d20|cn:>15; rola 6 dados de 20 faces e conte quantos resultados maiores que 15 saíram. <b>Ex.:</b> 3d100|cn:80..90; rola 3 dados de 100 lados e conte quantos resultados entre 80 e 90 saíram.

source: <b>Exploding dice:</b> operator "|ex:parameters". <b>Ex.:</b> 6d6|ex:6, roll 6 6-sided dice and, if any of them result in a 6, roll that die again, add to the result and so on. <b>Ex.:</b> 5d10|ex:>8, roll 5 10-sided dice and, if any of the results is greater than 8, roll that die again, add to the result and so on.
de: <b>Explodierende Würfel:</b> Befehl »|ex:parameter«. <b>Beispiel:</b> 6d6|ex:6, würfelt 6 6-seitige Würfel und jeden Würfel, der eine 6 zeigt, erneut. Dies passiert wieder, wenn erneut eine 6 gewürfelt wird – unendlich lang. <b>Beispiel:</b> 5d10|ex:>8, würfelt 5 10-seitige Würfel und jeden Würfel, der eine 10 zeigt, erneut. Wenn das neue Ergebnis auch 10 ist, wird der Würfel aber nicht erneut geworfen.
pt_br: <b>Explodindo dados:</b> operador "|ex:parâmetros". <b>Ex.:</b> 6d6|ex:6, rola 6 dados de 6 faces e, se algum resultar num 6, rola esse dado novamente, adiciona o resultado e assim por diante. <b>Ex.:</b> 5d10|ex:>8, rola 5 dados de 10 faces e, se algum dos resultados for maior que 8, rola esse dado novamente, adiciona o resultado e assim por diante.

source: <b>Reroll dice:</b> operator "|rr:parameters". <b>Ex.:</b> 6d6|rr:6, roll 6 6-sided dice and, if any of them result in a 6, reroll that die and keep the new result. <b>Ex.:</b> 5d10|rr:>8, roll 5 10-sided dice and, if any of the results is greater than 8, reroll that die and keep the new result.
de: <b>Erneut würfeln:</b> Befehl »|rr:parameter«. <b>Beispiel:</b> 6d6|rr:6, würfelt 6 6-seitige Würfel. Jeder Würfel, der eine 6 zeigt, wird erneut gewürfelt und das neue Ergebnis wird behalten. <b>Beispiel:</b> 5d10|rr:>8, würfelt 5 10-seitige Würfel. Jeder Würfel, der eine 8 oder höher zeigt, wird erneut gewürfelt und das neue Ergebnis wird behalten.
pt_br: <b>Rerolar dados:</b> operador "e". <b>Ex.:</b> 6d6|rr:6, rola 6 dados de 6 faces e, se algum resultar num 6, rola esse dado novamente e fica com o novo resultado. <b>Ex.:</b> 5d10|rr:>8, rola 5 dados de 10 faces e, se algum dos resultados for maior que 8, rola esse dado novamente e fica com o novo resultado.

source: <b>Nested functions:</b> You can use the result of one function as an input for another function. <b>Ex.:</b> 6d6|ex:6|cn:6, roll 6 6-sided dice and, if any of them result in a 6, roll that die again, add to the result and so on.Then, count how many 6s occur. <b>Ex.:</b> 5d10|kh:1|cn:>8, roll 5 10-sided dice and keep the highest, then, check if the result is greater than 8.
de: <b>Verschachtelte Funktionen:</b> Sie können das Ergebnis einer Funktion als Eingabe für eine andere Funktion verwenden. <b>Beispiel:</b> 6d6|ex:6|cn:6, würfelt 6 6-seitige Würfel und jeden Würfel, der eine 6 zeigt, erneut - so lange, bis keine 6 mehr gewürfelt wird. Dann wird die Anzahl 6er gezählt. <b>Beispiel:</b> 5d10|kh:1|cn:>8, würfelt 5 10-seitige Würfel und behält den höchsten. Dann wird überprüft, ob dieser Wurf höher als 8 ist.
pt_br: <b>Funções aninhadas:</b> Você pode usar o resultado de uma função como entrada para outra função. <b>Ex.:</b> 6d6|ex:6|cn:6, rola 6 dados de 6 faces e, se algum deles resultar num 6, role esse dado novamente e assim por diante.Então, conte quantos 6 saíram. <b>Ex.:</b> 5d10|kh:1|cn:>8, rola 5 dados de 10 faces e mantenha o maior, então, verifica se o resultado é maior que 8.
